# encoding: utf-8
# language: he
תכונה: ניהול פרויקטים

  תרחיש: צפייה ברשימת פרויקטים
    בהינתן שהמשתמש פותח את דף הפרויקטים
    אז קוד התגובה הוא 200
    אז הדף מכיל לפחות פרויקט אחד

  תרחיש: יצירת פרויקט חדש
    בהינתן שהמשתמש בעמוד הפרויקטים
    כאשר הוא שומר פרויקט חדש עם השם "פרויקט בדיקה"
    אז הפרויקט צריך להשמר בבסיס הנתונים
    אז הדף צריך להתעדכן עם הפרויקט החדש

  תרחיש: עריכת פרויקט קיים
    בהינתן שיש פרויקט קיים ברשימה
    כאשר המשתמש עורך אותו וגם משנה את השם
    אז השינוי צריך להשמר בבסיס הנתונים

  תרחיש: מחיקת פרויקט
    בהינתן שיש פרויקט קיים ברשימה
    כאשר המשתמש מבקש למחוק אותו
    אז הפרויקט צריך להימחק מבסיס הנתונים
    אז הרשימה צריכה להתעדכן
